# Записати умови, що істинні тоді й тільки тоді, коли:
# a)	натуральне число n – парне;
# b)	остання цифра числа n – 0;
# c)	сума першої і другої цифри двозначного
#       натурального числа n – двозначне число.
n = int(input()) #  n = 23
check_a = n % 2 == 0
print("натуральне число n – парне:", check_a)
check_b = n % 10 == 0
print("остання цифра числа n – 0:", check_b)

o = n % 10
d = n // 10
check_c = o + d >= 10
print("сума першої і другої цифри двозначного "
      "натурального числа n – двозначне число.", check_c)






