# Дано тризначне число. Перевірити чи
# a)	містить воно цифру 2;
# b)	складається лише з парних цифр;
# c)	сума його цифр дорівнює 18.
n = int(input()) # 452
o = n % 10
d = n // 10 % 10
s = n // 100
check_a = o == 2 or d == 2 or s == 2
print("містить цифру 2:", check_a)
# check_a1 = n == 222
# print("всі цифри є 2:", check_a1)
check_b = o % 2 == 0 and d % 2 == 0 and s % 2 == 0
print("складається лише з парних цифр", check_b)
check_c = o + d + s == 18
print("сума його цифр дорівнює 18: ", check_c)





